#+TITLE: dotemacs
#+AUTHOR: Tony Day
#+EMAIL: tonyday567 at gmail dot com
#+COLUMNS: %25ITEM %30tangle
#+PROPERTIES: tangle yes

*** load-path check
    :PROPERTIES:
    :tangle:   no
    :END:

checking on the result ...

The nice thing here is the startup process can store results in
variable, or you can just C-c C-c the block in org-mode after the event.

#+begin_src emacs-lisp
(setq load-path-check 
(loop for f in load-path
               collect
               (list f)))
#+end_src

#+RESULTS:
| /Users/tonyday/.emacs.d                                                                                                   |
| /Users/tonyday/.emacs.d/elpa/ess-20121027.2218/lisp                                                                       |
| /Users/tonyday/.emacs.d/repos/jwiegley/overrides/org-mode/contrib/lisp                                                    |
| /Users/tonyday/.emacs.d/repos/jwiegley/override/org-mode/contrib/lisp                                                     |
| /Users/tonyday/.emacs.d/site-lisp/less-css-mode                                                                           |
| /Users/tonyday/.emacs.d/site-lisp/o-blog                                                                                  |
| /Users/tonyday/.emacs.d/site-lisp                                                                                         |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/ac                                                                       |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/ace-jump-mode                                                            |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/asynk                                                                    |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/auctex                                                                   |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/auto-overlays                                                            |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/autopair                                                                 |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/bm                                                                       |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/bookmark-plus                                                            |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/boxquote                                                                 |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/command-log-mode                                                         |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/debbugs                                                                  |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/deft                                                                     |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/dired-sync                                                               |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/doxymacs                                                                 |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/dvc                                                                      |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/el-get                                                                   |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/el-mock                                                                  |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/elisp-depend                                                             |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/elisp-slime-nav                                                          |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/elnode                                                                   |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/emacs-edbi                                                               |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/emacs-quickrun                                                           |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/emacs-w3m                                                                |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/emms                                                                     |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/ess                                                                      |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/eval-expr                                                                |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/ghc-mod                                                                  |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/gist                                                                     |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/git-commit-mode                                                          |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/haskell-mode                                                             |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/helm                                                                     |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/helm-descbinds                                                           |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/hpaste                                                                   |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/hsenv.el                                                                 |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/ido-hacks                                                                |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/info-lookmore                                                            |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/ipa-el                                                                   |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/lua-mode                                                                 |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/lusty-emacs                                                              |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/macrostep                                                                |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/magit                                                                    |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/markdown-mode                                                            |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/melpa                                                                    |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/org-magit                                                                |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/org-merge-driver                                                         |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/python-mode                                                              |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/ruby-mode                                                                |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/session                                                                  |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/slime                                                                    |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/sunrise-commander                                                        |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/swank-js                                                                 |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/workgroups                                                               |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/wrap-region                                                              |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/yaml-mode                                                                |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/yari-with-buttons                                                        |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/yasnippet                                                                |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp/zencoding-mode                                                           |
| /Users/tonyday/.emacs.d/repos/jwiegley/site-lisp                                                                          |
| /Users/tonyday/.emacs.d/repos/jwiegley/override/bbdb                                                                      |
| /Users/tonyday/.emacs.d/repos/jwiegley/override/gnus                                                                      |
| /Users/tonyday/.emacs.d/repos/jwiegley/override/org-mode                                                                  |
| /Users/tonyday/.emacs.d/repos/jwiegley/override/tramp                                                                     |
| /Users/tonyday/.emacs.d/repos/jwiegley/override                                                                           |
| /Users/tonyday/.emacs.d/repos/jwiegley/lisp/alert                                                                         |
| /Users/tonyday/.emacs.d/repos/jwiegley/lisp/bind-key                                                                      |
| /Users/tonyday/.emacs.d/repos/jwiegley/lisp/chess                                                                         |
| /Users/tonyday/.emacs.d/repos/jwiegley/lisp/emacs-async                                                                   |
| /Users/tonyday/.emacs.d/repos/jwiegley/lisp/emacs-edg                                                                     |
| /Users/tonyday/.emacs.d/repos/jwiegley/lisp/erc-yank                                                                      |
| /Users/tonyday/.emacs.d/repos/jwiegley/lisp/gnus-harvest                                                                  |
| /Users/tonyday/.emacs.d/repos/jwiegley/lisp/haskell-config                                                                |
| /Users/tonyday/.emacs.d/repos/jwiegley/lisp/initsplit                                                                     |
| /Users/tonyday/.emacs.d/repos/jwiegley/lisp/muse                                                                          |
| /Users/tonyday/.emacs.d/repos/jwiegley/lisp/planner                                                                       |
| /Users/tonyday/.emacs.d/repos/jwiegley/lisp/regex-tool                                                                    |
| /Users/tonyday/.emacs.d/repos/jwiegley/lisp/springboard                                                                   |
| /Users/tonyday/.emacs.d/repos/jwiegley/lisp/use-package                                                                   |
| /Users/tonyday/.emacs.d/repos/jwiegley/lisp                                                                               |
| /Users/tonyday/.emacs.d/elpa/anything-1.287                                                                               |
| /Users/tonyday/.emacs.d/elpa/archives                                                                                     |
| /Users/tonyday/.emacs.d/elpa/auctex-11.86                                                                                 |
| /Users/tonyday/.emacs.d/elpa/bbdb-20120923.1954                                                                           |
| /Users/tonyday/.emacs.d/elpa/clojure-mode-1.11.5                                                                          |
| /Users/tonyday/.emacs.d/elpa/csv-mode-20091203.1911                                                                       |
| /Users/tonyday/.emacs.d/elpa/csv-nav-20091121.37                                                                          |
| /Users/tonyday/.emacs.d/elpa/elisp-slime-nav-0.2                                                                          |
| /Users/tonyday/.emacs.d/elpa/ess-20121027.2218                                                                            |
| /Users/tonyday/.emacs.d/elpa/find-file-in-project-3.2                                                                     |
| /Users/tonyday/.emacs.d/elpa/htmlize-1.39                                                                                 |
| /Users/tonyday/.emacs.d/elpa/ido-ubiquitous-1.5                                                                           |
| /Users/tonyday/.emacs.d/elpa/js-comint-0.0.1                                                                              |
| /Users/tonyday/.emacs.d/elpa/js2-mode-20090814                                                                            |
| /Users/tonyday/.emacs.d/elpa/json-1.2                                                                                     |
| /Users/tonyday/.emacs.d/elpa/magit-1.1.1                                                                                  |
| /Users/tonyday/.emacs.d/elpa/magithub-0.2                                                                                 |
| /Users/tonyday/.emacs.d/elpa/org-magit-0.2.0                                                                              |
| /Users/tonyday/.emacs.d/elpa/org2blog-0.5                                                                                 |
| /Users/tonyday/.emacs.d/elpa/paredit-22                                                                                   |
| /Users/tonyday/.emacs.d/elpa/slime-20100404.1                                                                             |
| /Users/tonyday/.emacs.d/elpa/smex-1.1.4                                                                                   |
| /Users/tonyday/.emacs.d/elpa/xml-rpc-1.6.8                                                                                |
| /Users/tonyday/.emacs.d/elpa/yaml-mode-0.0.7                                                                              |
| /Users/tonyday/.emacs.d/elpa/yasnippet-0.8.0                                                                              |
| /Users/tonyday/.emacs.d/elpa/yasnippet-bundle-0.6.1                                                                       |
| /Users/tonyday/.emacs.d/elpa/zenburn-theme-1.5                                                                            |
| /Users/tonyday/.emacs.d/elpa                                                                                              |
| /Users/tonyday/.emacs.d/repos/jwiegley/override/org-mode/lisp                                                             |
| /Users/david/src/emacs-dev/emacs-bzr/build-2012-10-24/nextstep/Emacs.app/Contents/Resources/share/emacs/24.2.50/site-lisp |
| /Users/david/src/emacs-dev/emacs-bzr/build-2012-10-24/nextstep/Emacs.app/Contents/Resources/share/emacs/site-lisp         |
| /Applications/Emacs241012.app/Contents/Resources/site-lisp                                                                |
| /Applications/Emacs241012.app/Contents/Resources/lisp                                                                     |
| /Applications/Emacs241012.app/Contents/Resources/lisp/vc                                                                  |
| /Applications/Emacs241012.app/Contents/Resources/lisp/url                                                                 |
| /Applications/Emacs241012.app/Contents/Resources/lisp/textmodes                                                           |
| /Applications/Emacs241012.app/Contents/Resources/lisp/progmodes                                                           |
| /Applications/Emacs241012.app/Contents/Resources/lisp/play                                                                |
| /Applications/Emacs241012.app/Contents/Resources/lisp/org                                                                 |
| /Applications/Emacs241012.app/Contents/Resources/lisp/nxml                                                                |
| /Applications/Emacs241012.app/Contents/Resources/lisp/net                                                                 |
| /Applications/Emacs241012.app/Contents/Resources/lisp/mh-e                                                                |
| /Applications/Emacs241012.app/Contents/Resources/lisp/mail                                                                |
| /Applications/Emacs241012.app/Contents/Resources/lisp/language                                                            |
| /Applications/Emacs241012.app/Contents/Resources/lisp/international                                                       |
| /Applications/Emacs241012.app/Contents/Resources/lisp/gnus                                                                |
| /Applications/Emacs241012.app/Contents/Resources/lisp/eshell                                                              |
| /Applications/Emacs241012.app/Contents/Resources/lisp/erc                                                                 |
| /Applications/Emacs241012.app/Contents/Resources/lisp/emulation                                                           |
| /Applications/Emacs241012.app/Contents/Resources/lisp/emacs-lisp                                                          |
| /Applications/Emacs241012.app/Contents/Resources/lisp/cedet                                                               |
| /Applications/Emacs241012.app/Contents/Resources/lisp/calendar                                                            |
| /Applications/Emacs241012.app/Contents/Resources/lisp/calc                                                                |
| /Applications/Emacs241012.app/Contents/Resources/lisp/obsolete                                                            |
| /Applications/Emacs241012.app/Contents/Resources/leim                                                                     |

*** diff-mode
    :PROPERTIES:
    :tangle:   yes
    :END:
#+begin_src emacs-lisp
;;;_ , diff-mode

(use-package diff-mode
  :commands diff-mode
  :config
  (use-package diff-mode-))

#+end_src

#+results:
: t

#+begin_src emacs-lisp
(setq vc-diff-switches '("-b" "-B" "-u"))
#+end_src

#+results:
| -b | -B | -u |


*** magit
    :PROPERTIES:
    :tangle:   yes
    :END:
#+begin_src emacs-lisp
;;;_ , magit

(use-package magit
  :bind ("C-x g" . magit-status)
  :config
  (progn
    (setenv "GIT_PAGER" "")

    (add-hook 'magit-log-edit-mode-hook
              #'(lambda ()
                  (set-fill-column 72)
                  (flyspell-mode)))

    (require 'magit-topgit)
    (require 'rebase-mode)

    (defun start-git-monitor ()
      (interactive)
      (start-process "git-monitor" (current-buffer) "~/bin/git-monitor"))

    ;;(add-hook 'magit-status-mode-hook 'start-git-monitor)
    ))

#+end_src

#+name: git-repos
| ~/git/scarce |
| ~/stuff      |
| ~/.emacs.d   |
| ~/git/o-blog |
| ~/git/quaff |


#+begin_src emacs-lisp :var table=git-repos  
     (setq magit-repo-dirs
           (loop for file in table
                     collect (car file)))
#+end_src

#+results:
| ~/git/scarce | ~/stuff | ~/.emacs.d | ~/git/o-blog | ~/git/quaff |

**** org-capture

#+name: captures
| key | desc           | type       | target type   | target path                | target header | template                                             |
|-----+----------------+------------+---------------+----------------------------+---------------+------------------------------------------------------|
| ,   | ,,             | entry      | file          | ~/stuff/org/refile.org     |               | * %?\n                                               |
| t   | todo           |            |               |                            |               |                                                      |
| tu  | urgent todo    | entry      | file          | ~/stuff/org/refile.org     |               | * NEXT %? :urgent:\n:PROPERTIES:\n:OPEN: %U\n:END:\n |
| tl  | linked todo    | entry      | file          | ~/stuff/org/refile.org     |               | * TODO %?\n%a\n                                      |
| tn  | next todo      | entry      | file          | ~/stuff/org/refile.org     |               | * NEXT %?\n                                          |
| tt  | todo todo      | entry      | file          | ~/stuff/org/refile.org     |               | * TODO %?\n                                          |
| tb  | yank body      | entry      | file          | ~/stuff/org/refile.org     |               | * TODO %?\n%c\n                                      |
| th  | yank header    | entry      | file          | ~/stuff/org/refile.org     |               | * TODO %c\n%?\n                                      |
| i   | idea           |            |               |                            |               |                                                      |
| ii  | idea           | entry      | file+headline | ~/stuff/content/ideas.org  | incoming      | * %? \n                                              |
| il  | idea link      | entry      | file+headline | ~/stuff/content/ideas.org  | links         | * %a \n %?                                           |
| iy  | idea yank      | entry      | file+headline | ~/stuff/content/ideas.org  | incoming      | * %?%c \n                                            |
| z   | bugz           | entry      | file+headline | ~/stuff/org/bugz.org       | incoming      | * TODO %?\n%a                                        |
| s   | snipz          |            |               |                            |               |                                                      |
| sr  | snipz request  | entry      | file+headline | ~/stuff/org/snipz.org      | incoming      | * TODO %?\n%a\n                                      |
| sn  | snipz note     | entry      | file+headline | ~/stuff/org/snipz.org      | incoming      | * %?\n%c\n                                           |
| b   | binding        | table-line | file+headline | ~/stuff/emacs/bindings.org | incoming      | %?                                                   |
| k   | kill ring      |            |               |                            |               |                                                      |
| kb  | kill ring body | entry      | file          | ~/stuff/org/refile.org     |               | * %?\n%c\n                                           |
| kh  | kill ring head | entry      | file          | ~/stuff/org/refile.org     |               | * %c\n%?\n                                           |


#+begin_src emacs-lisp :var data=captures  
  (setq org-capture-templates 
        (loop for row in (org-table-remove-header data)
              collect
              (eval (quote (car (read-from-string 
                                (replace-regexp-in-string "(  )" ""                                                     (replace-regexp-in-string "\"\"" "" 
                                (replace-regexp-in-string "\\\\n" "n" 
                                 (apply 'format "(%S %S %s (%s %S %S) %S)" row))))))))))
#+end_src

#+results:
| ,  | ,,             | entry      | (file ~/stuff/org/refile.org)                       | * %?\n                                               |
| t  | todo           |            |                                                     |                                                      |
| tu | urgent todo    | entry      | (file ~/stuff/org/refile.org)                       | * NEXT %? :urgent:\n:PROPERTIES:\n:OPEN: %U\n:END:\n |
| tl | linked todo    | entry      | (file ~/stuff/org/refile.org)                       | * TODO %?\n%a\n                                      |
| tn | next todo      | entry      | (file ~/stuff/org/refile.org)                       | * NEXT %?\n                                          |
| tt | todo todo      | entry      | (file ~/stuff/org/refile.org)                       | * TODO %?\n                                          |
| tb | yank body      | entry      | (file ~/stuff/org/refile.org)                       | * TODO %?\n%c\n                                      |
| th | yank header    | entry      | (file ~/stuff/org/refile.org)                       | * TODO %c\n%?\n                                      |
| i  | idea           |            |                                                     |                                                      |
| ii | idea           | entry      | (file+headline ~/stuff/content/ideas.org incoming)  | * %? \n                                              |
| il | idea link      | entry      | (file+headline ~/stuff/content/ideas.org links)     | * %a \n %?                                           |
| iy | idea yank      | entry      | (file+headline ~/stuff/content/ideas.org incoming)  | * %?%c \n                                            |
| z  | bugz           | entry      | (file+headline ~/stuff/org/bugz.org incoming)       | * TODO %?\n%a                                        |
| s  | snipz          |            |                                                     |                                                      |
| sr | snipz request  | entry      | (file+headline ~/stuff/org/snipz.org incoming)      | * TODO %?\n%a\n                                      |
| sn | snipz note     | entry      | (file+headline ~/stuff/org/snipz.org incoming)      | * %?\n%c\n                                           |
| b  | binding        | table-line | (file+headline ~/stuff/emacs/bindings.org incoming) | %?                                                   |
| k  | kill ring      |            |                                                     |                                                      |
| kb | kill ring body | entry      | (file ~/stuff/org/refile.org)                       | * %?\n%c\n                                           |
| kh | kill ring head | entry      | (file ~/stuff/org/refile.org)                       | * %c\n%?\n                                           |

**** agenda-files


#+TBLNAME: agenda-files
| git      | quaff   | quaff.org                  |
| git      | quaff   | data.org                   |
| git      | quaff   | moments.org                |
| git      | quaff   | edhec.org                  |
| git      | quaff   | jgb.org                    |
| stuff    |         | stuff.org                  |
| .emacs.d |         | README.org                 |
| .emacs.d |         | dotemacs.org               |
| stuff    | org     | refile.org                 |
| stuff    | org     | bugz.org                   |
| stuff    | org     | snipz.org                  |
| stuff    | org     | table-tests.org            |
| stuff    | org     | org.org                    |
| stuff    | emacs   | emacs.org                  |
| stuff    | emacs   | bindings.org               |
| stuff    | emacs   | regexp.org                 |
| stuff    | sys     | sys.org                    |
| stuff    | sys     | git.org                    |
| stuff    | biz     | scarce.org                 |
| stuff    | content | life.org                   |
| stuff    | content | writing.org                |
| stuff    | dev     | webdev.org                 |
| stuff    | dev     | sandpit.org                |
| stuff    | dev     | jsdev.org                  |
| stuff    | factor  | factor.org                 |
| stuff    | content | ideas.org                  |
| stuff    | factor  | parity.org                 |
| stuff    | quant   | rdev.org                   |
| stuff    | quant   | bunny.org                  |
| stuff    | quant   | volatility.org             |
| stuff    | quant   | strategy_run_annotated.org |
| stuff    | quant   | strategy_run_default.org   |
| stuff    | quant   | momentum.org               |
| stuff    | quant   | mom-report.org             |
| stuff    | quant   | xkcd.org                   |
| stuff    | quant   | tail.org                   |
| stuff    | quant   | da.org                     |
| stuff    | sys     | git.org                    |
| git      | scarce  | scarce.org                 |
| git      | scarce  | mindev.org                 |
| git      | scarce  | sitedev.org                |
| stuff    | quant   | earnings.org               |
| stuff    | dev     | alice.org                  |
| stuff    | quant   | acme.org                   |
| stuff    | quant   | dcf.org                    |
| stuff    | content | grob.org                   |
| git      | hft     | hft.org                    |
| stuff    | content | poker.org                  |

  #+begin_src emacs-lisp :var data=agenda-files
    (setq clean-table
          (delete nil  
                  (loop for line in data
                        collect 
                        (delete "" (delete-dups line)))))
    
    (setq org-agenda-files
          (mapcar
           (lambda (x) 
             (concat "~/"
                     (mapconcat
                      'eval x "/")))
           clean-table))
  #+end_src

  #+results:
  | ~/git/quaff/quaff.org | ~/git/quaff/data.org | ~/git/quaff/moments.org | ~/git/quaff/edhec.org | ~/git/quaff/jgb.org | ~/stuff/stuff.org | ~/.emacs.d/README.org | ~/.emacs.d/dotemacs.org | ~/stuff/org/refile.org | ~/stuff/org/bugz.org | ~/stuff/org/snipz.org | ~/stuff/org/table-tests.org | ~/stuff/org/org.org | ~/stuff/emacs/emacs.org | ~/stuff/emacs/bindings.org | ~/stuff/emacs/regexp.org | ~/stuff/sys/sys.org | ~/stuff/sys/git.org | ~/stuff/biz/scarce.org | ~/stuff/content/life.org | ~/stuff/content/writing.org | ~/stuff/dev/webdev.org | ~/stuff/dev/sandpit.org | ~/stuff/dev/jsdev.org | ~/stuff/factor/factor.org | ~/stuff/content/ideas.org | ~/stuff/factor/parity.org | ~/stuff/quant/rdev.org | ~/stuff/quant/bunny.org | ~/stuff/quant/volatility.org | ~/stuff/quant/strategy_run_annotated.org | ~/stuff/quant/strategy_run_default.org | ~/stuff/quant/momentum.org | ~/stuff/quant/mom-report.org | ~/stuff/quant/xkcd.org | ~/stuff/quant/tail.org | ~/stuff/quant/da.org | ~/stuff/sys/git.org | ~/git/scarce/scarce.org | ~/git/scarce/mindev.org | ~/git/scarce/sitedev.org | ~/stuff/quant/earnings.org | ~/stuff/dev/alice.org | ~/stuff/quant/acme.org | ~/stuff/quant/dcf.org | ~/stuff/content/grob.org | ~/stuff/content/poker.org |

***** tags
  #+begin_src emacs-lisp
  ; Tags with fast selection keys
(setq org-tag-alist (quote (("urgent" . ?u)
                            ("bill" . ?b)
                            ("scarce" . ?s)
                            ("crypt" . ?c)
                            ("emacs" . ?e))))
#+end_src 

  #+results:
  | (urgent . 117) | (bill . 98) | (scarce . 115) | (crypt . 99) | (emacs . 101) |
***** babel languages
   #+begin_src emacs-lisp 
    (org-babel-do-load-languages
       (quote org-babel-load-languages)
       (quote ((emacs-lisp . t)
               (sh . t)
               (gnuplot . t)
               (org . t)
               (octave . t)
               (js . t)
               (R . t))))
  #+end_src

   #+results:
   | (emacs-lisp . t) | (sh . t) | (gnuplot . t) | (org . t) | (octave . t) | (js . t) | (R . t) |
***** link abbreviations
  #+begin_src emacs-lisp
  (setq org-link-abbrev-alist
       '(("google"    . "http://www.google.com/search?q=")))
#+end_src

  #+results:
  | (google . http://www.google.com/search?q=) |
***** mobileorg settings
  #+begin_src emacs-lisp 
  (setq org-default-notes-file "~/stuff/org/refile.org")
  ;; Set to the name of the file where new notes will be stored
  (setq org-mobile-inbox-for-pull "~/stuff/org/refile.org")
  ;; Set to <your Dropbox root directory>/MobileOrg.
  (setq org-mobile-directory "~/Dropbox/MobileOrg")
#+end_src

  #+results:
  : ~/Dropbox/MobileOrg
